# -*- coding: utf-8 -*-
"""Webinar9.ipynb

Automatically generated by Colaboratory.

Original file is located at
    https://colab.research.google.com/drive/1kKX5ZjlwmCG781OUbF5VEInXh5iXyf-G

## Задача №57

1. Прочесть с помощью pandas файл *california_housing_test.csv*, который находится в папке *sample_data*.
"""

import pandas as pd

df = pd.read_csv('sample_data/california_housing_test.csv')

df.head()

"""2. Посмотреть сколько в нем строк и столбцов"""

df.shape

"""3. Определить какой тип данных имеют столбцы"""

df.dtypes

"""## Задача №59

1. Проверить есть ли в файле пустые значения
"""

df.isnull().sum()

"""2. Показать *median_house_value* где *median_income < 2*"""

df[df['median_income'] < 2]['median_house_value']

"""3. Показать данные в первых 2 столбцах"""

df[df.columns[0:2]]

"""4. Выбрать данные где *housing_median_age* < 20 и *median_house_value* > 70000"""

df[(df['housing_median_age']<20) & (df['median_house_value']>70000)]

"""## Задача №61

1. Определить какое максимальное и минимальное значение *median_house_value*
"""

print(f"max 'median_house_value' = {df['median_house_value'].max()}")
print(f"min 'median_house_value' = {df['median_house_value'].min()}")

"""2. Показать максимальное *median_house_value*, где *median_income* = 3.1250"""

print(f"max median_house_value where median_income = 3.125 => {df[df['median_income'] == 3.1250]['median_house_value'].max()}")

"""3. Узнать какая максимальная population в зоне минимального значения *median_house_value*"""

df[df['median_house_value'] == df['median_house_value'].min()]['population'].max()